<template>
  <div class="main">
    <div class="container">
      <div class="rules-title">法律声明及隐私政策</div>
      <div class="rules-content">
        概览
        “出入福安门岗出入电子登记系统”（以下简称“我们”或“出入福安”）深知隐私对您的重要性，并会尽全力保护您的隐私。请在向我们提交个人信息之前，阅读、了解并同意本《隐私政策》（以下简称“本政策”）。
        我们制定本政策的目的在于帮助您了解以下内容：
        1. 个人信息的收集与使用；
        2. 我们收集哪些个人信息；
        3. 我们如何使用您的信息；
        4. 如何访问和控制您的个人信息；
        5. 我们如何保护您的个人信息；
        6. 第三方提供商及服务；
        7. 本政策如何更新；
        8. 如何联系我们。
        您使用或继续使用我们的产品或服务，均表示您同意我们按照本政策收集、使用、储存和分享您的信息。我们恳请您定期阅读本政策和任何补充政策，以确保对我们隐私政策最新版本保持了解。
        1. 个人信息的收集与使用
        个人信息是可用于识别或联系特定个人的信息。
        在您使用我们的产品或服务时，可能会要求您提供个人信息。为能够更好地满足您的需求，将根据本政策的约定使用这些信息，并将这些信息与其他信息结合起来，用于提供和改进我们的产品、服务、内容和广告宣传。您不是一定要提供我们要求的个人信息，但在许多情况下，如果您选择不提供，我们将无法为您提供我们的产品或服务，也无法回应您遇到的任何问题。
        2. 我们收集哪些个人信息
        您在注册我们的账户或使用我们的服务时，可能会被要求提供用户的姓名、家庭地址、电话号码、电子邮件等信息。
        当您进入我们的小程序，我们收集和汇总诸如哪些页面受到了访问，访问的顺序，链接途径等信息。
        在您通过我们的服务向其他方提供共享服务时，我们可能获得该方的相关个人信息。
        您在使用我们的服务时储存的信息。
        3. 我们如何使用您的信息
        我们尽可能将在向您提供服务的过程之中所收集的信息用作以下用途：
        向您提供服务；
        在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
        帮助我们设计新服务，改善我们现有服务；
        使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他使用我们服务的用户作出其他方面的回应；
        向您提供与您更加相关的广告以替代普遍投放的广告；
        不时通过电子邮件、电话或其他电子信息媒体向您发送营销信息，除非您与我们联系并通知我们您不希望收到这个信息；
        评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；
        软件认证或管理软件升级；
        让您参与有关我们产品和服务的调查。
        为了让我们的用户有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过我们的某一项服务所收集的个人信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的您的个人信息，可能在另一服务中用于向您提供特定内容或向您展示与您相关的、而非普遍推送的信息。如我们在相关服务之中提供了相应选项，您也可以主动要求我们将您在该服务所提供和储存的个人信息用于我们的其他服务。
        我们不会因商业原因将您的个人信息出售给第三方。但是在获得您的明确同意后，我们会与其他方共享您的个人信息。另，在法律、法律程序、诉讼或主管部门有要求的情况下，我们可能会披露您的个人信息，这些机构可能会使用您的个人信息，以便查看您是否涉嫌违反法律或违反监管规则。
        4. 如何访问和控制您的个人信息
        您可以随时管理自己的个人信息，例如您的账户信息。您应确保提供的所有个人信息都准确无误。我们将尽量采取适当的技术手段，保证您可以访问、更新和更正您的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除您的个人信息时，我们可能会要求您进行身份验证，以保障您的账户安全。
        5. 我们如何保护您的个人信息
        我们重视个人信息的安全。我们采取业内标准做法来保护您的个人信息，防止信息遭到未经授权访问、披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，我们会使用加密技术确保数据的机密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人数据；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人数据重要性的认识。
        我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人数据，除非需要延长保留期或受到法律的允许。我们会尽力保护您的个人数据，但是请注意任何安全措施都无法做到无懈可击。
        6. 第三方提供商及其服务
        为确保流畅的浏览体验，您可能会收到来自我们及其合作伙伴外部的第三方（下文简称“第三方”）提供的内容或网络链接。我们对此类第三方无控制权。您可选择是否访问第三方提供的链接、内容、产品和服务。
        我们无法控制第三方的隐私和信息保护政策，此类第三方不受到本政策的约束。在向第三方提交个人信息之前，请参见这些第三方的隐私保护政策。
        7. 本政策如何更新
        我们保留不时更新或修改本政策的权利。我们会通过不同渠道向您发送变更通知。对于隐私政策变更，我们会将最新版隐私政策发布在我们的网站上。
        8. 如何联系我们
        如果您对本政策有任何疑问、意见或建议，请发送电子邮件至我们的客服邮箱：service@mind.club，我们将会在十五日内答复您。
      </div>
      <button @tap="sureRule" class="rules-btn">确定</button>
    </div>
  </div>
</template>

<script>
import wepy from '@wepy/core'

wepy.page({
  hooks: {},
  data: {},
  methods: {
    sureRule() {
      wx.navigateBack()
    }
  }
})
</script>
<config>
  {
    navigationBarTitleText: '法律声明及隐私条款',
    usingComponents: {
    }
  }
</config>
<style lang="less" scoped>
page {
  height: 100%;
  background-color: #f0f0f0;
}
.main {
  display: flex;
  flex-direction: column;
  padding: 0 20rpx;
  .container {
    text-align: center;
    background: #fff;
    padding: 20rpx 20rpx 100rpx;
    .rules-title {
      font-size: 36rpx;
      color: #222;
    }
    .rules-content {
      font-size: 24rpx;
      color: #666;
      white-space: pre-wrap;
      line-height: 46rpx;
      margin-top: 24rpx;
      text-align: left;
    }
    .rules-btn {
      position: fixed;
      bottom: 0;
      left: 0;
      width: 100%;
      font-size: 32rpx;
      border-radius: 8rpx;
      color: #fff;
      background: #3a6eff;
      line-height: 100rpx;
    }
  }
}
</style>
